In [29]:
import pandas as pd
import numpy as np

In [16]:
print(pd.__version__)

2.1.1

In [42]:
list=[1,2,3,5]
pd.Series(list)

0    1
1    2
2    3
3    5
dtype: int64

In [46]:
Names=['Ravi','Jiva','Linda','Loha']
pd.Series(Names,index=["a","b","c","d"])

a     Ravi
b     Jiva
c    Linda
d     Loha
dtype: object

In [47]:
Student_mks={"Ravi":172,"Goata":230,"Tota":345}
pd.Series(Student_mks)

Ravi     172
Goata    230
Tota     345
dtype: int64

In [51]:
arr=np.arange(2,6)
print(arr)
pd.Series(arr)

[2 3 4 5]

0    2
1    3
2    4
3    5
dtype: int32

In [20]:
print(pd.__version__)
df=pd.DataFrame()
print(df)

2.1.1
Empty DataFrame
Columns: []
Index: []

In [23]:
countries = {'Name': ['USA', 'India', 'German', 'Rwanda'], 
             
             'Codes':[1, 91, 49, 250] }

In [26]:
df=pd.DataFrame(countries)
df

     Name  Codes
0     USA      1
1   India     91
2  German     49
3  Rwanda    250

In [37]:
array = np.array ([[1,2,3], [4,5,6], [7,8,9]])

print(pd.DataFrame(array))

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [39]:

pd.DataFrame(array, columns = ['column 1', 'column 2', 'column 3'])

   column 1  column 2  column 3
0         1         2         3
1         4         5         6
2         7         8         9

In [61]:
Student_mks={"Ravi":172,"Goata":230,"Tota":345}
result=pd.Series(Student_mks)
df=pd.DataFrame(result,columns=['Marks'])
print(df)

       Marks
Ravi     172
Goata    230
Tota     345

In [65]:
df['Gender']=['Male','TransGender','Gay']
print(df)

       Marks       Gender
Ravi     172         Male
Goata    230  TransGender
Tota     345          Gay

In [66]:
#remove Gender columns
df.drop('Gender',axis=1)

       Marks
Ravi     172
Goata    230
Tota     345

In [67]:
df.columns

Index(['Marks', 'Gender'], dtype='object')

In [68]:
df.keys

<bound method NDFrame.keys of        Marks       Gender
Ravi     172         Male
Goata    230  TransGender
Tota     345          Gay>

In [69]:
df.index

Index(['Ravi', 'Goata', 'Tota'], dtype='object')

### Data Indexing and Selection in Both Series and Pandas

In [72]:
Student_mks={"Ravi":[172,290,432],"Goata":[230,345,233],"Tota":[345,245,324]}
df=pd.DataFrame(Student_mks,index=['Maths','Physics','English'])
df

         Ravi  Goata  Tota
Maths     172    230   345
Physics   290    345   245
English   432    233   324

In [73]:
df['Ravi']

Maths      172
Physics    290
English    432
Name: Ravi, dtype: int64

In [74]:
df.Ravi

Maths      172
Physics    290
English    432
Name: Ravi, dtype: int64

In [75]:
df[['Ravi','Tota']]

         Ravi  Tota
Maths     172   345
Physics   290   245
English   432   324

In [87]:
df [0:2]#First two rows of table

         Ravi  Goata  Tota
Maths     172    230   345
Physics   290    345   245

In [88]:
df.loc['Maths']

Ravi     172
Goata    230
Tota     345
Name: Maths, dtype: int64

In [90]:
df.iloc[1:3]

         Ravi  Goata  Tota
Physics   290    345   245
English   432    233   324

In [91]:
df.iloc[2:]

         Ravi  Goata  Tota
English   432    233   324

In [126]:
df

         Ravi  Goata  Tota
Maths     172    230   345
Physics   290    345   245
English   432    233   324

In [134]:
df[df['Ravi']==290]

         Ravi  Goata  Tota
Physics   290    345   245

In [135]:
df[df['Ravi']>200]

         Ravi  Goata  Tota
Physics   290    345   245
English   432    233   324

In [143]:
list=[432,878,958,290,897,445]
df.isin(list)

          Ravi  Goata   Tota
Maths    False  False  False
Physics   True  False  False
English   True  False  False

In [146]:
df2=pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),columns=['Fisrt','Second','Third'])
df2

   Fisrt  Second  Third
0      1       2      3
1      4       5      6
2      7       8      9

In [147]:
for col_name,content in df2.items():
    print(col_name)
    print(content)

Fisrt
0    1
1    4
2    7
Name: Fisrt, dtype: int32
Second
0    2
1    5
2    8
Name: Second, dtype: int32
Third
0    3
1    6
2    9
Name: Third, dtype: int32

In [150]:
for row in df2.iterrows():
    print(row)

(0, Fisrt     1
Second    2
Third     3
Name: 0, dtype: int32)
(1, Fisrt     4
Second    5
Third     6
Name: 1, dtype: int32)
(2, Fisrt     7
Second    8
Third     9
Name: 2, dtype: int32)

In [152]:
for row in df2.itertuples():
    print(row)

Pandas(Index=0, Fisrt=1, Second=2, Third=3)
Pandas(Index=1, Fisrt=4, Second=5, Third=6)
Pandas(Index=2, Fisrt=7, Second=8, Third=9)

In [156]:
df3 = pd.DataFrame(np.array ([[11,12,13], [14,np.nan,16], [71,np.nan,np.nan]]), 
                   columns = ['C1', 'C2', 'C3'])
df3

     C1    C2    C3
0  11.0  12.0  13.0
1  14.0   NaN  16.0
2  71.0   NaN   NaN

In [157]:
df3.isnull()

      C1     C2     C3
0  False  False  False
1  False   True  False
2  False   True   True

In [158]:
df3.isnull().sum()#number of null place in table of data Frame

C1    0
C2    2
C3    1
dtype: int64

In [159]:
df3.notna()

     C1     C2     C3
0  True   True   True
1  True  False   True
2  True  False  False

In [160]:
df3.notna().sum()

C1    3
C2    1
C3    2
dtype: int64

In [162]:
df3.dropna()

     C1    C2    C3
0  11.0  12.0  13.0

In [166]:

df3.dropna(axis=1)

     C1
0  11.0
1  14.0
2  71.0

In [167]:

df3.dropna(axis=0)

     C1    C2    C3
0  11.0  12.0  13.0

In [169]:
df3.fillna(-1)

     C1    C2    C3
0  11.0  12.0  13.0
1  14.0  -1.0  16.0
2  71.0  -1.0  -1.0

In [170]:

df3.fillna('LOvera Sur')

     C1          C2          C3
0  11.0        12.0        13.0
1  14.0  LOvera Sur        16.0
2  71.0  LOvera Sur  LOvera Sur

In [181]:
df4 = pd.DataFrame({'Product Name':['Shirt','Boot','Bag'], 
              'Order Number':[56,67,68], 
              'Total Quantity':[14,25,29]}, 
              columns = ['Product Name', 'Order Number', 'Total Quantity'])
df4

  Product Name  Order Number  Total Quantity
0        Shirt            56              14
1         Boot            67              25
2          Bag            68              29

In [182]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product Name    3 non-null      object
 1   Order Number    3 non-null      int64
 2   Total Quantity  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [183]:
df4.columns

Index(['Product Name', 'Order Number', 'Total Quantity'], dtype='object')

In [184]:
df4.keys

<bound method NDFrame.keys of   Product Name  Order Number  Total Quantity
0        Shirt            56              14
1         Boot            67              25
2          Bag            68              29>

In [188]:
df4.head(1)

  Product Name  Order Number  Total Quantity
0        Shirt            56              14

In [189]:
df4.tail(1)

  Product Name  Order Number  Total Quantity
2          Bag            68              29

In [190]:
df4.values

array([['Shirt', 56, 14],
       ['Boot', 67, 25],
       ['Bag', 68, 29]], dtype=object)

In [191]:
df4.size

9

In [192]:
df4.shape

(3, 3)

In [194]:

df4['Product Name'].unique()

array(['Shirt', 'Boot', 'Bag'], dtype=object)

In [195]:
df4['Product Name'].nunique()

3

In [196]:
df4['Product Name'].value_counts()

Product Name
Shirt    1
Boot     1
Bag      1
Name: count, dtype: int64

In [197]:
df4.describe()

       Order Number  Total Quantity
count      3.000000        3.000000
mean      63.666667       22.666667
std        6.658328        7.767453
min       56.000000       14.000000
25%       61.500000       19.500000
50%       67.000000       25.000000
75%       67.500000       27.000000
max       68.000000       29.000000

In [198]:
df4.describe().transpose()

                count       mean       std   min   25%   50%   75%   max
Order Number      3.0  63.666667  6.658328  56.0  61.5  67.0  67.5  68.0
Total Quantity    3.0  22.666667  7.767453  14.0  19.5  25.0  27.0  29.0

In [199]:
df4['Total Quantity'].mode()

0    14
1    25
2    29
Name: Total Quantity, dtype: int64

In [200]:
df4['Total Quantity'].max()

29

In [201]:
df4['Total Quantity'].min()

14

In [202]:
df4['Total Quantity'].mean()

22.666666666666668

In [203]:

df4['Total Quantity'].median()

25.0

In [204]:
df4['Total Quantity'].std()

7.767453465154029

In [205]:
df4['Total Quantity'].var()

60.33333333333333

In [206]:
df4['Total Quantity'].sum()

68

In [207]:
df4['Total Quantity'].prod()

10150